tutorials/compressible/PBNS/cpbnsPIMPLE/compressiblePitzDaily/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss skewCorrected linear;
}

divSchemes
{
    default         none;
    div(phi,Ek)     Gauss skewCorrected linearVanLeer;
    div(phi,U)      Gauss skewCorrected linearVanLeer;
    div(phiHat,p)   Gauss skewCorrected linearVanLeer;
    div(phi,KE)     Gauss linear skewCorrected;
    div(phi,h)      Gauss skewCorrected linearVanLeer;
    div(phi,k)      Gauss skewCorrected linearVanLeer;
    div((muEff*dev2(T(grad(U))))) Gauss linear skewCorrected;
    div(((muEff*grad(U))&U)) Gauss skewCorrected linear;
    div(((muEff*dev2(T(grad(U))))&U)) Gauss skewCorrected linear;
}

laplacianSchemes
{
    default         Gauss skewCorrected linear corrected;
}

interpolationSchemes
{
    default         skewCorrected linear;
    reconstruct(T)  linearVanLeer;
}

snGradSchemes
{
    default         skewCorrected corrected;
}


// ************************************************************************* //
